[["All chiropractors provide the same treatment.","busted","There are over 100 different chiropractic techniques used in practice today. Each of the four chiropractors at the SMSC Wellness Center treat and adjust patients differently. "],["Adjustments are not grinding and cracking your bones.","confirmed","The popping noise often heard during an adjustment is the release of gas bubbles from between your joints. This is the same noise you hear when you \"crack\" your knuckles. "],["The Wellness Center only treats back pain.","busted","While the Wellness Center sees many people for back pain, the physical therapists, occupational therapist, and chiropractors at the Wellness Center treat a wide range of conditions."],["I only need to go to the dentist when I have a problem.","busted","Going to the dentist regularly for cleanings and exams aids in early detection of cavities, oral cancer, and other oral health issues."],["Bad teeth genetics run in the family.","plausible","Dental cavities and gum disease are not inherited. Cavities are mainly caused by bacteria, sugars, and plaque."],["Cavities in baby teeth do not need to be filled.","busted","Cavities in baby teeth can grow rapidly and cause pain and infection."],["My manager will know if I go to ASPIRE.","busted","ASPIRE appointments are confidential."],["ASPIRE provides more than mental health resources.","confirmed","ASPIRE provides numerous resources that can be used to address life challenges that are personal and work related."],["ASPIRE is only available to employees.","busted","ASPIRE is available to help SMSC employees\/team members, their spouses, and their dependents find the right help at the right time."],["Medication therapy management is only available at the SMSC Pharmacy.","busted","Medication therapy management is part of your primary care appointments at the Shakopee Dakota Medical Clinic."],["Pharmacists shouldn't need to call the doctor for refills if you're told that you would be on the medication for life.","busted","All prescriptions expire at some point and require doctor authorization."],["If you feel well, you still need to take prescribed medication exactly as prescribed.","confirmed","Taking prescriptions at the wrong time or skipping doses disrupts therapy and may cause a flare or other adverse event."],["Eating carrots will improve your vision.","busted","While carrots provide Vitamin A, an essential nutrient for the eyes, they will not prevent a person from needing glasses."],["Vision loss happens and there is nothing you can do to prevent it.","busted","With early intervention and screening, vision may be saved."],["Sitting close to a TV all day will hurt your eyesight.","busted ","There's no evidence that sitting close to the TV can damage someone's eyes. However, sitting close to a TV may be a sign of near-sightedness."],["Spouses are not allowed to participate in the 2019 Fitbit program.","busted","New in 2019, there will be a couples tier that incentivizes both employees and their spouses to move more to earn more!"],["Spouses can enroll in the Fitbit program even if the employee is not.","busted","The employee and their spouse must BOTH be enrolled in the 2019 Fitbit program and reach the SAME tier or higher to be eligible for the couples tier reimbursements. "],["If I reach the Sneakers tier or higher every month next year (January 2019-January 2020), I will receive a $100 gift card.","confirmed","To incentivize Fitbit participants to stay active, employees who consecutively reach the Sneakers tier or above from January 2019 - January 2020 will receive a $100 VISA gift card in February 2020."],["The SMSC on-site clinics are free of charge.","plausible","If you are have the Aware 80 or Aware 70 plan, or have met your deductible in the Aware HD plan, there are no co-pays or deductibles."],["There are no X-ray services available at the SMSC.","busted ","X-rays are available at the Shakopee Dakota Medical Clinic."],["There are no diabetes or nutrition services available at SMSC Clinics.","busted ","There is an on-site certified diabetes educator and nutrition services available at the Shakopee Dakota Medical Clinic."],["You can create plant-based versions of your favorite meat dishes.","confirmed","There are a lot of various protein substitutes you can use to replace meat. "],["Mazopiya produce only comes from Wozupi.","busted","Mazopiya receives their produce and products from Wozupi and other organic vendors and sources."],["The reFresh Bar at Mazopiya only sells juices and smoothies.","busted","The reFresh Bar also offers coffee, tea, booster shots, and more."],["Fat turns into muscle.","busted","Muscle is protein, water, and glycogen. Muscle powers movement. Fat stores energy for movement and produces hormones."],["You can exercise away a bad diet.","busted","To lose body fat, it is more prudent to consume calories of a healthier nature (better food choices) combined with an overall calorie deficit (demanding exercise) to lose appropriate body weight."],["Cardio and strength are both important for training.","confirmed","In a Penn State study, dieters lost 21 pounds whether they performed cardio or strength training. However, for the cardio group, six of those pounds came from muscle, while the lifters lost nearly all fat."],["The best medical plan the SMSC has is the most expensive one.","busted","There isn't a \"best\" medical plan. It all depends on you and your family's needs and health situation."],["I can add\/drop my health insurance at any time during the year.","plausible ","Other than open enrollment, you can only add\/drop your coverage due to a qualified life event (i.e. marriage\/divorce, baby, loss\/gain of coverage elsewhere, etc.)."],["Benefits staff is only available during Human Resources window hours.","busted","Benefits are available from 8am-5pm Monday - Friday. Please call the Benefits Helpline at 952.496.7314 or email them at benefit@mysticlake.com for assistance."],["Disabilities only happen to old people.","busted","The Social Security Administration estimates that just over 1 in 4 of today's 20-year-olds will become disabled before reaching age 67."],["Medical insurance, workers' compensation, or the Social Security disability program will help me financially if I become disabled.","busted","Medical insurance doesn't replace lost income, workers' compensation only covers job-related issues, and Social Security Disability Insurance (SSDI) only helps if you are terminal or your disability is expected to last at least a year."],["Most disabilities are not caused by an accident.","confirmed","About 90 percent of all disabilities are caused by illness rather than accidents."],["It's important to make the decision to go on a diet.","busted","\"On a diet\" sets us up to think we will eventually be \"off a diet\". Instead, think of your weight loss plan as a lifestyle commitment to healthy eating and exercise."],["You need to exercise to lose weight.","plausible","You can lose weight without exercising, but studies have shown that adding physical activity can increase your weight loss by 20 percent. It's most important to simply move more in ways that you enjoy and that are fun and engaging."],["Weight Watchers meetings are boring and they make you weigh in in front of everyone.","busted","Weight Watchers meetings are fun, motivational, educational, and provide a sense of community. Participate as little or as much as you want. Weigh-ins are 100 percent private and confidential."],["Saving the amount that the SMSC will match in a 401(k) will earn you enough to retire comfortably.","busted","Each participant has unique needs in retirement. MassMutual provides an online Participant Dashboard reviewing your current allocation contributions alongside your suggested income and growth for retirement."],["Your expenses at retirement go up.","plausible","Rising health-care costs and a changing lifestyle may contribute to a higher rate of spending. If you plan to travel, or have a second home, you may find your expenses could actually increase."],["Social Security will provide enough income for you to retire comfortably on.","plausible","In 2016, the average person received $1,341 per month ($16,092 annually) from Social Security. Will this provide a comfortable retirement for you?"],["Health Insurance won't cover any treatment resulting from injuries caused by dangerous hobbies such as rock climbing or scuba diving.","busted","Health insurance will cover treatment as specified in your plan regardless of how the injuries are sustained."],["You don't get any health care services until you pay your deductible.","busted","Unlike auto and home insurance, health insurance works differently in that most medical plans give you free access to preventive services even if you haven't met your deductible."],["Medical insurance is available to part-time team members and employees.","confirmed","Part-time team members or employees must have an average of 30 hours\/week in a 12-month look back period to be offered the same medical coverage as full-time team members\/employees."]]